{
  "heading" : {
    "en" : "Projects & References",
    "de" : "Projekte & Referenzen" },

  "projects" : [
    { "key"       : "rollgame2018",
      "title"     : "RollGame",
      "date"      : "2018-03-01",
      "caption"   : {
        "en" : "An arcade video game loosely inspired by Guitar Hero and BIT.TRIP BEAT about rolling heroes fighting against orcs. Programmed using C#, MonoGame and MonoGame.Extended. In development since March 2018.",
        "de" : "Ein Arcade-Videospiel, lose inspiriert von Guiter Hero und BIT.TRIP BEAT, mit rollenden Helden, die gegen Orks kämpfen. Mit C#, MonoGame und MonoGame.Extended programmiert. In der Entwicklung seit März 2018." },
      "authors"   : [ "Maximilian Söchting" ],
      "thumbnail" : "2018-rollgame.jpg",
      "downloads" : [
        { "href"  : "https://drive.google.com/open?id=1Gz8Hsol0G0HalIS_VbFaOFOwfze1j4Yh",
          "desc"  : "Showcase (06.04.2018)"
        }, {
          "href"  : "#",
          "desc"  : "Dev Blog (coming soon)"
        } ],
    },
    { "key"       : "mfsv2016",
      "title"     : "MFSV",
      "date"      : "2016-08-30",

      "caption"   : {
        "en" : "A prototypical WebGL-based Multi-frame Sampling viewer for 3D scenes using Three.js. Developed under the supervision of Daniel Limberger as part of the seminar 'Introduction to Visual Analytics' in the summer semester 2016 at HPI.",
        "de" : "Ein prototypischer WebGL-basierter Multi-frame Sampling Viewer für 3D-Szenen. Entwickelt unter der Betreuung von Daniel Limberger als Teil des Seminars 'Einführung in die Visual Analytics' im Sommersemester 2016 am HPI." },

      "authors"   : [ "Maximilian Söchting", "Daniel Limberger" ],
      "thumbnail" : "2016-mfsv.jpg",
      "downloads" : [
        { "href"  : "https://github.com/msoechting/mfsv",
          "desc"  : "Project (GitHub)"
        }, {
          "href"  : "http://msoechting.github.io/mfsv",
          "desc"  : "Demos"
        } ],
    },
    { "key"       : "busdriver2016",
      "title"     : "BusDriver",
      "date"      : "2016-01-30",

      "caption"   : {
        "en" : "A bus driving simulation with video game character developed in Smalltalk as part of the Software Architecture lecture in the winter semester 2015/16 at HPI. Developed together with Julian Weise and Johannes Schneider.",
        "de" : "Eine Busfahrsimulation mit Videospielcharakter welche in einem dreiköpfigen Team als Teil der Softwarearchitektur-Vorlesung im Wintersemester 2015/16 am HPI in Smalltalk implementiert wurde. Entwickelt zusammen mit Julian Weise und Johannes Schneider." },

      "authors"   : [ "Maximilian Söchting" ],
      "thumbnail" : "2016-busdriver.jpg",
      "downloads" : [
        { "href"  : "https://youtu.be/X0DitZCjQF0",
          "desc"  : "Showcase (YouTube)"
        } ],
    },
    { "key"       : "blindexcel2016",
      "title"     : "Excel for the Blind - Linespace",
      "date"      : "2016-01-20",

      "caption"   : {
        "en" : "As part of the lecture 'Designing Interactive Systems' in the winter semester 2015/16 by Prof. Patrick Baudisch, we formed student teams and developed apps for a research prototype called Linespace. Our team of three developed a spreadsheet application for Linespace that enables blind users to browse through Excel spreadsheets, edit formulas in it and explore graphs by having Linespace draw them on the surface. An overview of our primary design choices can be found in the slides 64-69 or in the linked talk, starting at 13m:50s.",
        "de" : "Als Teil der Veranstaltung 'Designing Interactive Systems' im Wintersemester 2015/16 von Prof. Patrick Baudisch, habe wir Studententeams gebildet und Apps für den Forschungsprototypen Linespace entwickelt. Unser dreiköpfiges Team entwickelte eine Tabellenanwendung für Linespace, die es blinden Benutzern ermöglicht, bestimmte Werte in der Tabelle auszulesen, Formeln zu bearbeiten und Graphen durch Linespace zeichnen zu lassen. Ein kleiner Überblick über unsere größeren Designentscheidungen kann man in den Folien 64 bis 69 im unten stehenden Link oder im verlinkten Talk ab 13m:50s finden.",
    },

      "authors"   : [ "Maximilian Söchting" ],
      "thumbnail" : "2016-blindexcel.jpg",
      "downloads" : [
        { "href"  : "http://stefaniemueller.org/linespace/",
          "desc"  : "What is Linespace?"
        },
        { "href"  : "https://youtu.be/EGxcSqq-204?t=821",
          "desc"  : "CHI2016 Linespace talk"
        } ],
    },
    { "key"       : "randomteamdef2012",
      "title"     : "Programming custom game modes for StarCraft II",
      "date"      : "2012-01-01",

      "caption"   : {
        "en" : "With the help of the StarCraft II Map Editor, I designed and programmed multiple custom game modes for StarCraft II. One of my published maps called 'RandomTeamDefense', was consistently placed in the top 12 most played custom game modes for over 6 months after its release and has over 2500 reviews on Battle.Net with an average of 4.7 out of 5 stars",
        "de" : "Mit der Hilfe des StarCraft II-Karteneditors habe ich mehrere 'Arcade'-Karten für StarCraft II konzipiert und programmiert. Einer meiner veröffentlichten Karten namens 'RandomTeamDefense' war für über 6 Monate nach dem Release in den 'Top 12 Meistgespielt' und hat über 2500 Bewertungen im Battle.Net, mit einer durchschnittlichen Bewertung von 4.7 von 5 Sternen.",
        },

      "authors"   : [ "Maximilian Söchting" ],
      "thumbnail" : "2012-randomteamdef.jpg",
      "downloads" : [
        { "href"  : "battlenet:://starcraft/map/2/126755",
          "desc"  : "View RandomTeamDefense in the Battle.Net (requires StarCraft II to be installed)"
        } ]
    },
     ]
}
