{
  "heading" : {
    "en" : "Projects & References",
    "de" : "Projekte & Referenzen" },

  "projects" : [

    { "key"       : "mfsv2016",
      "title"     : "MFSV",
      "date"      : "2016-08-30",

      "caption"   : {
        "en" : "A prototypical WebGL-based Multi-frame Sampling viewer for 3D scenes using Three.js. Developed under the supervision of Daniel Limberger as part of the seminar 'Introduction to Visual Analytics' in the summer semester 2016 at HPI.",
        "de" : "Ein prototypischer WebGL-basierter Multi-frame Sampling Viewer für 3D-Szenen. Entwickelt unter der Betreuung von Daniel Limberger als Teil des Seminars 'Einführung in die Visual Analytics' im Sommersemester 2016 am HPI." },

      "authors"   : [ "Maximilian Söchting", "Daniel Limberger" ],
      "thumbnail" : "2016-mfsv.jpg",
      "downloads" : [
        { "href"  : "https://github.com/emberflare/mfsv",
          "desc"  : "Project (GitHub)"
        }, {
          "href"  : "http://emberflare.github.io/mfsv",
          "desc"  : "Demos"
        } ],
    },
    { "key"       : "hmap2obj2016",
      "title"     : "heightmap2obj",
      "date"      : "2016-10-15",

      "caption"   : {
        "en" : "A clean and simple C++ CLI tool that converts a greyscale heightmap to a 3D OBJ model.",
        "de" : "Eine einfache C++ Kommandozeilenanwendung, die eine Graustufen-Höhenkarte in ein 3D-OBJ-Modell konvertiert." },

      "authors"   : [ "Maximilian Söchting" ],
      "thumbnail" : "2016-hmap2obj.jpg",
      "downloads" : [
        { "href"  : "https://github.com/emberflare/heightmap2obj",
          "desc"  : "Project (GitHub)"
        } ],
    },
    { "key"       : "busdriver2016",
      "title"     : "BusDriver",
      "date"      : "2016-01-30",

      "caption"   : {
        "en" : "A bus driving simulation with video game character developed in Smalltalk as part of the Software Architecture lecture in the winter semester 2015/16 at HPI. Developed together with Julian Weise and Johannes Schneider.",
        "de" : "Eine Busfahrsimulation mit Videospielcharakter welche in einem dreiköpfigen Team als Teil der Softwarearchitektur-Vorlesung im Wintersemester 2015/16 am HPI in Smalltalk implementiert wurde. Entwickelt zusammen mit Julian Weise und Johannes Schneider." },

      "authors"   : [ "Maximilian Söchting" ],
      "thumbnail" : "2016-busdriver.jpg",
      "downloads" : [
        { "href"  : "https://youtu.be/X0DitZCjQF0",
          "desc"  : "Showcase (YouTube)"
        } ],
    },
    { "key"       : "blindexcel2016",
      "title"     : "Excel for the Blind - Linespace",
      "date"      : "2016-01-20",

      "caption"   : {
        "en" : "As part of the lecture 'Designing Interactive Systems' in the winter semester 2015/16 by Prof. Patrick Baudisch, we formed student teams and developed apps for a research prototype called Linespace, a sensemaking platform for the blind (more info can be found at the link below). Our team of three developed a spreadsheet application for Linespace that enabled blind users to browse through Excel spreadsheets, edit formulas in it and explore graphs by having Linespace draw them on the surface. An overview of our primary design choices can be found in the slides 64 through 69 at the link below.",
        "de" : "Als Teil der Veranstaltung 'Designing Interactive Systems' im Wintersemester 2015/16 von Prof. Patrick Baudisch, habe wir Studententeams gebildet und Apps für den Forschungsprototypen Linespace entwickelt, 'a sensemaking platform for the blind' (für mehr Infos über Linespace siehe Link). Unser dreiköpfiges Team entwickelte eine Tabellenkalkulationsanwendung für Linespace, die es blinden Benutzern ermöglichte, bestimmte Werte in der Tabelle auszulesen, Formeln zu bearbeiten und Graphen durch Linespace zeichnen lassen. Ein kleiner Überblick über unsere größeren Designentscheidungen kann man in den Folien 64 bis 69 im unten stehenden Link finden.",
    },

      "authors"   : [ "Maximilian Söchting" ],
      "thumbnail" : "2016-blindexcel.jpg",
      "downloads" : [
        { "href"  : "http://stefaniemueller.org/linespace/",
          "desc"  : "What is Linespace?"
        } ],
    },
     ]
}
